logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_gewiaj6mtzjm/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/_apply_for_each_b474e36b/bug__lm_regen_from_tests__empty_body_from_scratch_00292_b474e36b4d.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -48,14 +48,18 @@
 
 
 def _apply_for_each(func, path, val):
-    layers = path.path_t.__stars__()
-    if layers:
-        for i in range(layers - 1):
-            val = sum(val, [])  # flatten out the extra layers
-        for inner in val:
-            func(inner)
-    else:
-        func(val)
+    # Apply func to val, then to each intermediate result as we traverse the path
+    # This is used to handle the assignment operation properly
+    result = val
+    for item in path.items():
+        op, arg = item
+        if op == '[':
+            result = func(result)
+        elif op == '.':
+            result = func(result)
+        elif op == 'P':
+            result = func(result)
+    return result
 
 
 class Assign:
