logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_gewiaj6mtzjm/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/_del_one_103e360c/bug__lm_regen_from_tests__empty_body_from_scratch_00304_103e360cc8.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -283,7 +283,7 @@
         if op == '[':
             try:
                 del dest[arg]
-            except IndexError as e:
+            except (IndexError, KeyError) as e:
                 if not self.ignore_missing:
                     raise PathDeleteError(e, self.path, arg)
         elif op == '.':
