logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_gewiaj6mtzjm/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/_del_sequence_item_b7d1b14a/bug__lm_regen_from_tests__empty_body_from_scratch_00297_b7d1b14a42.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -349,6 +349,7 @@
 
 def _del_sequence_item(target, idx):
     del target[int(idx)]
+    # this is an exact match
 
 
 def _delete_autodiscover(type_obj):
