logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_gewiaj6mtzjm/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/glomit_0a1318e6/bug__lm_regen_from_tests__empty_body_from_scratch_00305_0a1318e65e.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -313,6 +313,7 @@
         except PathAccessError as pae:
             if not self.ignore_missing:
                 raise
+            return target
         else:
             _apply_for_each(lambda dest: self._del_one(dest, op, arg, scope), path, dest)
 
