logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_ql4mbrrqznnz/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/get_message_313a6116/bug__lm_regen_from_tests__empty_body_from_scratch_00299_313a6116dc.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -42,6 +42,10 @@
     ``@property`` or exception being raised inside a ``__delattr__()``.
 
     """
+    def get_message(self):
+        return ('could not delete %r on object at %r, got error: %r'
+                % (self.dest_name, self.path, self.exc))
+
     def get_message(self):
         return ('could not delete %r on object at %r, got error: %r'
                 % (self.dest_name, self.path, self.exc))
