logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_wxnknl6gvktb/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/__repr___c4e5d6dc/bug__lm_regen_from_tests__empty_body_from_scratch_00302_c4e5d6dc04.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -178,6 +178,17 @@
         _apply_for_each(_apply, path, dest)
 
         return target
+
+    assert repr(Assign(T.a, 1)) == 'Assign(T.a, 1)'
+    assign_spec = Assign(T.a, 1, missing=dict)
+    assert repr(assign_spec) == 'Assign(T.a, 1, missing=dict)'
+    assert repr(assign_spec) == repr(eval(repr(assign_spec)))
+
+    def __repr__(self):
+        cn = self.__class__.__name__
+        if self.missing is None:
+            return f'{cn}({self._orig_path!r}, {self.val!r})'
+        return f'{cn}({self._orig_path!r}, {self.val!r}, missing={bbrepr(self.missing)})'
 
     def __repr__(self):
         cn = self.__class__.__name__
