logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_wxnknl6gvktb/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/__repr___c4e5d6dc/bug__lm_regen_from_tests__empty_body_from_scratch_00306_c4e5d6dc04.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -318,8 +318,18 @@
 
         return target
 
+    assert repr(Delete(T.a)) == 'Delete(T.a)'
+
     def __repr__(self):
         cn = self.__class__.__name__
+        if self.missing is None:
+            return f'{cn}({self._orig_path!r}, {self.val!r})'
+        return f'{cn}({self._orig_path!r}, {self.val!r}, missing={bbrepr(self.missing)})'
+
+    def __repr__(self):
+        cn = self.__class__.__name__
+        if self.ignore_missing:
+            return f'{cn}({self._orig_path!r}, ignore_missing={self.ignore_missing})'
         return f'{cn}({self._orig_path!r})'
 
 
