logs/bug_gen/mahmoud__glom.fb3c4e76/bedrock_converse_arn_aws_bedrock_eu_west_1_210939678973_application_inference_profile_wxnknl6gvktb/mahmoud__glom.fb3c4e76__glom__mutation.py/attempt1/assign_8b38c669/bug__lm_regen_from_tests__empty_body_from_scratch_00293_8b38c669a1.diff
--- a/glom/mutation.py
+++ b/glom/mutation.py
@@ -187,20 +187,6 @@
 
 
 def assign(obj, path, val, missing=None):
-    """*New in glom 18.3.0*
-
-    The ``assign()`` function provides convenient "deep set"
-    functionality, modifying nested data structures in-place::
-
-      >>> target = {'a': [{'b': 'c'}, {'d': None}]}
-      >>> _ = assign(target, 'a.1.d', 'e')  # let's give 'd' a value of 'e'
-      >>> pprint(target)
-      {'a': [{'b': 'c'}, {'d': 'e'}]}
-
-    Missing structures can also be automatically created with the
-    *missing* parameter. For more information and examples, see the
-    :class:`~glom.Assign` specifier type, which this function wraps.
-    """
     return glom(obj, Assign(path, val, missing=missing))
 
 
